/*
 *  -> 1.데이터형 (변수) -> 데이터를 제어(가공):연산자 -> 데이터제어(제어문) -> 화면출력
 *  					-------------------
 *   자바에서 지원하는 연산자
 *   			  ----
 *   			  피연산자, 연산자
 *   			  ------ 연산대상
 *   			  피연산자 1개 (단항연산자) -10
 *   			  피연산자 2개 (이항연산자) 10 + 10
 *   			  피연산자 3개 (삼항연산자) ()? a : b
 *   
 *   단항연산자 : 데이터 한개를 연산
 *    = 증감연산자 (++,--) : 한개를 증가,감소 (반복문)
 *    = 반전연산자 (~) : 부호를 바꿈
 *    = 부정연산자 (!) : 반드시 boolean만 사용이 가능 !true = false, !false = true (조건문)
 *    	 ex)예약일이 아닐때
 *    = 형변환연산자 : (type) -> (int), (double) ....
 *    = 음수/양수 : - , + 
 *   이항연산자 : 데이터가 2개일때 연산
 *    = 산술연산자 : ( + , - , * , / , % ) % -> 나누고 나머지 값 : 형변환 주의점
 *    = 비트연산자 : ( & , | , ^ ) -> 2진법 변경후 처리
 *    	  & -> * , | -> +
 *    = 쉬프트연산자 : 비트 이동 연산자 -> <<(왼쪽이동), >>(오른쪽 이동)
 *    = 비교연산자 : == , != , < , > , <= , >=
 *    = 논리연산자 : && (직렬연산자) , || (병렬연산자)
 *    = 대입연산자 : = , += , -= , *= , /= , %= ... op=
 *    				  -----------------------------복합 대입 연산자
 *    = 기타 : 문자열 비교 , 객체 비교
 *    		  equals() , instanceof
 *   삼항연산자
 *    = 조건 ? 값1 : 값2
 *    		 ---   ---
 *    		 true false --> if~else
 *    --> 연산자 사용위치 -----> 제어문 (반복문 : 코테)
 */
public class 단항연산자_증감연산자 {
	/*
	 *  증감연산자 (1개 증가(++) , 1개 감소(--))
	 *  int a = 10;
	 *  a--;
	 *  a = 9
	 *  
	 *  int b = 10;
	 *  b++;
	 *  b = 11
	 *  
	 *  ---> 전치연산자 : 먼저 증가
	 *  	  ++a;
	 *       후치연산자 : 나중 증가
	 *        a++;
	 *        
	 *     int a = 10;
	 *     int b = ++a;
	 *     	  ---  ---
	 *     	   2  	1
	 *         증가먼저 후 대입
	 *     --------------- a = 11, b = 11
	 *     int a = 10;
	 *     int b = a++;
	 *     	  ---  ---
	 *         1    2
	 *         대입하고 나중에 증가
	 *     --------------- a = 11, b = 10;
	 *     
	 *     int a = 10;
	 *     int b = ++a + a++ + a++ + ++a;
	 *     			11    11    12    14 
	 *     a = 14, b = 48
	 *     
	 *     int a = 10;
	 *     int b = ++a + a++ + a-- + --a;
	 *     			11    11    12    10
	 *     a = 10, b = 44
	 *     
	 *     -------------------- 계산 방식 (컴파일러에 따라 결과값이 다르다)
	 *     
	 *     int a = 10;
	 *     int b = ++a;
	 *     
	 *     int a = 10;
	 *     int b = a++; 이것만 알아둬도됨
	 *     
	 *     -------------------- 증감연산자 (int, char)
	 *     
	 *     char c = 'A'
	 *     c++;
	 *     c = 'B'
	 *     
	 *     ++ , -- (무조건 증가1, 감소1) -> 저장된 데이터가 변경된다 (반복문에서 많이 쓰임)
	 *     
	 *     
	 */
	public static void main(String[] args) {
		int a = 10;
		int b = ++a;
		System.out.println("a=" + a + ",b=" + b);
		
		a = 10;
		b = a++;
		System.out.println("a=" + a + ",b=" + b);
		
		a = 10;
		b = ++a + a++ + a++ + ++a;
		System.out.println("a=" + a + ",b=" + b);
		
		a = 10;
		b = ++a + a++ + a-- + --a;
		System.out.println("a=" + a + ",b=" + b);
	}

}



